artillery/support-questions/queries/care_reception.yml
config:
  target: 'https://lemonade.leersteun.lars-tst.school'
  processor: "../../utils/response-logger.js"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Care reception load"
  environments:
    tst:
      target: 'https://lemonade.leersteun.lars-tst.school'
      phases:
        - duration: 1
          arrivalRate: 1
      variables:
        learning_support_center_id_: "4126aba9-622d-4ada-98c3-2eb319793ec6"    
      payload:
        path: '../../data/acc-learning-support-centers.csv'
        fields:
          - 'learning_support_center_id'
          - 'name'
          - 'access_token' 
          - 'mongo_claims'
        skipHeader: true
        delimiter: ','  
    acc:
      target: 'https://lemonade.leersteun.lars-acc.school'
      phases:
        - duration: 1
          arrivalRate: 1
      payload:
        path: '../../data/acc-learning-support-centers.csv'
        fields:
          - 'learning_support_center_id'
          - 'name'
          - 'access_token' 
          - 'mongo_claims'
        skipHeader: true
        delimiter: ','
    prd:
      target: 'https://leersteun.lars.school'
      phases:
        - duration: '10m'
          arrivalRate: 30
          maxVusers: 5000
        # - duration: '5m'
        #   arrivalRate: 10
        #   rampTo: 50  
      payload:
        path: '../../data/prd-learning-support-centers.csv'
        fields:
          - 'learning_support_center_id'
          - 'name'
          - 'access_token' 
          - 'mongo_claims'
        skipHeader: true
        delimiter: ','
  # plugins:
  #   apdex:
  #     threshold: 1500
  variables:
    access_token_: "{{ $env.ACCESS_TOKEN }}"
    mongo_claims_: "{{ $env.MONGO_CLAIMS }}"

scenarios:
  - name: "Support Question View Query"
    weight: 100
    flow:
      # - log: 'Current environment is set to: {{ $environment }} and LSC is: {{ name }} {{ learning_support_center_id }}'
      - parallel:
        # Support Questions list
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: 
                    $in:
                      - "{{ learning_support_center_id }}"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set: 
                  supportQuestionStatus: "$supportQuestion.status"
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              - $match:
                  supportQuestionStatus:
                    $in:
                      - "OPEN"
                      - "INCOMPLETE"
                      - "ARCHIVED"
              - $sort:
                  creationDate: -1
              - $facet:
                  data:
                    - $skip: 0
                    - $limit: 50
                  pagination:
                    - $count: "count"
            # beforeRequest: "logRequest"        
            # afterResponse: "logResponse"
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        # Filter group by weight
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: 
                    $in:
                      - "{{ learning_support_center_id }}"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set:
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              - $match:
                  status:
                    $in:
                      - "OPEN"
                      - "INCOMPLETE"
              - $group:
                  _id: "$verslag.type"
                  key:
                    $max: "$verslag.type"
                  count:
                    $sum: 1
              - $sort:
                  creationDate: -1
            # beforeRequest: "logRequest"      
            # afterResponse: "logResponse"
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        # Filter group by team name
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: 
                    $in:
                      - "{{ learning_support_center_id }}"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set:
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              - $match:
                  status:
                    $in:
                      - "OPEN"
                      - "INCOMPLETE"
              - $group:
                  _id: "$team.name"
                  key:
                    $max: "$team.name"
                  count:
                    $sum: 1
              - $sort:
                  creationDate: -1
            # afterResponse: "logResponse"
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        # Filter group by 
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: 
                    $in:
                      - "{{ learning_support_center_id }}"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set:
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              - $set:
                  schoolEntityDetails:
                    $concat:
                      - "$schoolEntity.schoolEntity.displayName"
                      - "$schoolEntityName"        
              - $match:
                  status:
                    $in:
                      - "OPEN"
                      - "INCOMPLETE"
              - $group:
                  _id: "$schoolEntityDetails"
                  key:
                    $max: "$schoolEntityDetails"
                  count:
                    $sum: 1
              - $sort:
                  creationDate: -1
            # afterResponse: "logResponse"
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        # Filter group by 
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: 
                    $in:
                      - "{{ learning_support_center_id }}"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set:
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              - $match:
                  status:
                    $in:
                      - "OPEN"
                      - "INCOMPLETE"
              - $group:
                  _id: "$verslag.typeReport"
                  key:
                    $max: "$verslag.typeReport"
                  count:
                    $sum: 1
              - $sort:
                  creationDate: -1
            # afterResponse: "logResponse"
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        # Filter group by 
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: 
                    $in:
                      - "{{ learning_support_center_id }}"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set:
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              - $match:
                  status:
                    $in:
                      - "OPEN"
                      - "INCOMPLETE"
              - $group:
                  _id: "$supportQuestion.status"
                  key:
                    $max: "$supportQuestion.status"
                  count:
                    $sum: 1
              - $sort:
                  creationDate: -1
            # afterResponse: "logResponse"
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        # Filter group by 
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: 
                    $in:
                      - "{{ learning_support_center_id }}"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set:
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              - $match:
                  status:
                    $in:
                      - "OPEN"
                      - "INCOMPLETE"
              - $group:
                  _id: "$supportQuestion.workflow"
                  key:
                    $max: "$supportQuestion.workflow"
                  count:
                    $sum: 1
              - $sort:
                  creationDate: -1
            # afterResponse: "logResponse"
            afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        # Filter group by 
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: 
                    $in:
                      - "{{ learning_support_center_id }}"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set:
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              - $match:
                  status:
                    $in:
                      - "OPEN"
                      - "INCOMPLETE"
              - $group:
                  _id: "$verslag.educationForm"
                  key:
                    $max: "$verslag.educationForm"
                  count:
                    $sum: 1
              - $sort:
                  creationDate: -1
            # afterResponse: "logResponse"
            # afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200
        # Filter group by 
        - post:
            url: "/api/zorglink/zorglink-support-question-view"
            headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
            json:
              - $match:
                  learningSupportCenterId: 
                    $in:
                      - "{{ learning_support_center_id }}"
              - $set:
                  schoolEntityName:
                    $ifNull:
                      - "$schoolEntity.name"
                      - ""
              - $set:
                  schoolEntityName:
                    $cond:
                      if:
                        $ne:
                          - "$schoolEntityName"
                          - ""
                      then:
                        $concat:
                          - " - "
                          - "$schoolEntityName"
                      else: ""
              - $match:
                  status:
                    $in:
                      - "OPEN"
                      - "INCOMPLETE"
              - $group:
                  _id: "$trajectory.assignee.displayName"
                  key:
                    $max: "$trajectory.assignee.displayName"
                  count:
                    $sum: 1
              - $sort:
                  creationDate: -1
            # afterResponse: "logResponse"
            # afterResponse: "logErrorResponse"
            expect:
              - statusCode: 200